asuFlumeCleanCases/2dAsuFlume_singleParticle/0/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{

inlet
{
    type            codedFixedValue;
    value           uniform 1;  // Default initial value
    name            timeDependentAlpha;  // Unique name for the boundary condition

    code
    #{
        scalar t = this->db().time().value();
        scalarField& field = *this;

        // Set alpha value based on time
        if (((t >= 0.0) && (t <= 4.0)))
        {
            field = scalar(0.95);  // Set alpha value to 0.3
        }
        else
        {
            field = scalar(0.0);  // Set alpha value to 0.0
        }
    #};
 }
  top
    {
        type            calculated;
        value           uniform 1;
    }
    groundAndWall
    {
        type            calculated;
        value           uniform 1;
    }
    axis
    {
        type            calculated;
        value           uniform 1;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
