asuFlumeCleanCases/2dAsuFlume_singleParticle/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 1e5;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    top
    {
        type            prghPressure;
        p               $internalField;
        value           $internalField;
    }

    groundAndWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    frontAndBack
      {
	type    empty;
      }
    axis
      {
        type            fixedFluxPressure;
        value           $internalField;	
      }
    
}

// ************************************************************************* //
