asuFlumeCleanCases/2dAsuFlume_singleParticle/0/ph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      ph;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 100149.14;

boundaryField
{
    wall
    {
        type               zeroGradient;
    }
    inlet
    {
        type               zeroGradient;
    }
    axis
    {
        type               zeroGradient;
    }
    top
    {
        type               fixedValue;
        value              uniform 100149.14;
    }

    frontAndBack
    {
        type            empty;
    }

}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
