asuFlumeCleanCases/2dAsuFlume_singleParticle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          16;
        startFace       19750;
    }
    top
    {
        type            patch;
        nFaces          200;
        startFace       19766;
    }
    groundAndWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20284;
        startFace       19966;
    }
)

// ************************************************************************* //
