asuFlumeCleanCases/2dAsuFlume_singleParticle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
 
vertices
(
    // Lower block (0 to 0.08 in y)
    (0 0    0)     
    (1 0    0)     
    (1 0.20 0)   
    (0 0.20 0)   
    (0 0    0.08) // inlet  
    (1 0    0.08)  
    (1 0.20 0.08)
    (0 0.20 0.08)

    // Upper block (0.075 to 0.25 in y)
    (0 0.0  0.25)   //water height
    (1 0.0  0.25)   
    (1 0.20 0.25)
    (0 0.20 0.25)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 1 16) simpleGrading (1 1 1) // Lower block
    hex (4 5 6 7 8 9 10 11) (200 1 34) simpleGrading (1 1 1) // Upper block
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    top
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }
    
    groundAndWall
    {
        type wall;
        faces
        (
            (4 8 11 7)
            (5 9 8 4)
	    (6 10 9 5)
	    (7 11 10 6)
            (1 5 4 0)
            (2 6 5 1)
            (3 7 6 2)
            (1 0 3 2)
        );
    }

);


// ************************************************************************* //
