asuFlumeCleanCases/2dAsuFlume_singleParticle/system/graphUniform
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start and
    end points. A specified number of graph points are used, distributed
    uniformly along the line.

\*---------------------------------------------------------------------------*/
 
start           (0.1 0 0);
end             (0.1 0.25 0);
nPoints         50;
 
fields          (alpha.particles1);

axis            y;

#includeEtc "caseDicts/functions/graphs/graphUniform.cfg"

// ************************************************************************* //
